app/views/posts/index.html.haml

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1
---
          .name-and-time
            = raw render_emoji (post.user.name), options = {:class=>'user-name'} if post.user.present?