app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"   ORDER BY "posts"."created_at" ASC
---
  def index
    @posts = Post.all.order(:created_at).reverse